Revit 2026 API

# WallFunction Enumeration

---

Indicates the function of a specified WallType, as specified in the parameter FUNCTION_PARAM on the WallType.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum WallFunction
```
```vb
Public Enumeration WallFunction
```
```cpp
public enum class WallFunction
```
```fsharp
type WallFunction
```

| Member name | Value | Description |
| --- | --- | --- |
| Coreshaft | 5 | A coreshaft wall. |
| Exterior | 1 | An exterior wall. |
| Foundation | 2 | A foundation wall. |
| Interior | 0 | An interior wall. |
| Retaining | 3 | A retaining wall. |
| Soffit | 4 | A soffit wall. |

#### Reference

Autodesk.Revit.DB Namespace